{
    "meals": [
        {
            "idMeal": "52874",
            "strMeal": "Beef and Mustard Pie",
            "strDrinkAlternate": null,
            "strCategory": "Beef",
            "strArea": "British",
            "strInstructions": "Preheat the oven to 150C/300F/Gas 2.\r\nToss the beef and flour together in a bowl with some salt and black pepper.\r\nHeat a large casserole until hot, add half of the rapeseed oil and enough of the beef to just cover the bottom of the casserole.\r\nFry until browned on each side, then remove and set aside. Repeat with the remaining oil and beef.\r\nReturn the beef to the pan, add the wine and cook until the volume of liquid has reduced by half, then add the stock, onion, carrots, thyme and mustard, and season well with salt and pepper.\r\nCover with a lid and place in the oven for two hours.\r\nRemove from the oven, check the seasoning and set aside to cool. Remove the thyme.\r\nWhen the beef is cool and you're ready to assemble the pie, preheat the oven to 200C/400F/Gas 6.\r\nTransfer the beef to a pie dish, brush the rim with the beaten egg yolks and lay the pastry over the top. Brush the top of the pastry with more beaten egg.\r\nTrim the pastry so there is just enough excess to crimp the edges, then place in the oven and bake for 30 minutes, or until the pastry is golden-brown and cooked through.\r\nFor the green beans, bring a saucepan of salted water to the boil, add the beans and cook for 4-5 minutes, or until just tender.\r\nDrain and toss with the butter, then season with black pepper.\r\nTo serve, place a large spoonful of pie onto each plate with some green beans alongside.",
            "strMealThumb": "https://www.themealdb.com/images/media/meals/sytuqu1511553755.jpg",
            "strTags": "Meat,Pie",
            "price": "23"
        },
        {
            "idMeal": "52878",
            "strMeal": "Beef and Oyster pie",
            "strDrinkAlternate": null,
            "strCategory": "Beef",
            "strArea": "British",
            "strInstructions": "Season the beef cubes with salt and black pepper. Heat a tablespoon of oil in the frying pan and fry the meat over a high heat. Do this in three batches so that you don’t overcrowd the pan, transferring the meat to a large flameproof casserole dish once it is browned all over. Add extra oil if the pan seems dry.\r\nIn the same pan, add another tablespoon of oil and cook the shallots for 4-5 minutes, then add the garlic and fry for 30 seconds. Add the bacon and fry until slightly browned. Transfer the onion and bacon mixture to the casserole dish and add the herbs.\r\nPreheat the oven to 180C/350F/Gas 4.\r\nPour the stout into the frying pan and bring to the boil, stirring to lift any stuck-on browned bits from the bottom of the pan. Pour the stout over the beef in the casserole dish and add the stock. Cover the casserole and place it in the oven for 1½-2 hours, or until the beef is tender and the sauce is reduced.\r\nSkim off any surface fat, taste and add salt and pepper if necessary, then stir in the cornflour paste. Put the casserole dish on the hob – don’t forget that it will be hot – and simmer for 1-2 minutes, stirring, until thickened. Leave to cool.\r\nIncrease the oven to 200C/400F/Gas 6. To make the pastry, put the flour and salt in a very large bowl. Grate the butter and stir it into the flour in three batches. Gradually add 325ml/11fl oz cold water – you may not need it all – and stir with a round-bladed knife until the mixture just comes together. Knead the pastry lightly into a ball on a lightly floured surface and set aside 250g/9oz for the pie lid.\r\nRoll the rest of the pastry out until about 2cm/¾in larger than the dish you’re using. Line the dish with the pastry then pile in the filling, tucking the oysters in as well. Brush the edge of the pastry with beaten egg.\r\nRoll the remaining pastry until slightly larger than your dish and gently lift over the filling, pressing the edges firmly to seal, then trim with a sharp knife. Brush with beaten egg to glaze. Put the dish on a baking tray and bake for 25-30 minutes, or until the pastry is golden-brown and the filling is bubbling.",
            "strMealThumb": "https://www.themealdb.com/images/media/meals/wrssvt1511556563.jpg",
            "strTags": "Pie",
            "price": "3.32"
        },
        {
            "idMeal": "53071",
            "strMeal": "Beef Asado",
            "strDrinkAlternate": null,
            "strCategory": "Beef",
            "strArea": "Filipino",
            "strInstructions": "0.\tCombine beef, crushed peppercorn, soy sauce, vinegar, dried bay leaves, lemon, and tomato sauce. Mix well. Marinate beef for at least 30 minutes.\r\n1.\tPut the marinated beef in a cooking pot along with remaining marinade. Add water. Let boil.\r\n2.\tAdd Knorr Beef Cube. Stir. Cover the pot and cook for 40 minutes in low heat.\r\n3.\tTurn the beef over. Add tomato paste. Continue cooking until beef tenderizes. Set aside.\r\n4.\tHeat oil in a pan. Fry the potato until it browns. Turn over and continue frying the opposite side. Remove from the pan and place on a clean plate. Do the same with the carrots.\r\n5.\tSave 3 tablespoons of cooking oil from the pan where the potato was fried. Saute onion and garlic until onion softens.\r\n6.\tPour-in the sauce from the beef stew. Let boil. Add the beef. Cook for 2 minutes.\r\n7.\tAdd butter and let it melt. Continue cooking until the sauce reduces to half.",
            "strMealThumb": "https://www.themealdb.com/images/media/meals/pkopc31683207947.jpg",
            "strTags": null,
            "price": "4.44"
            
        },
        {
            "idMeal": "53070",
            "strMeal": "Beef Caldereta",
            "strDrinkAlternate": null,
            "strCategory": "Beef",
            "strArea": "Filipino",
            "strInstructions": "0.\tHeat oil in a cooking pot. Saute onion and garlic until onion softens\r\n1.\tAdd beef. Saute until the outer part turns light brown.\r\n2.\tAdd soy sauce. Pour tomato sauce and water. Let boil.\r\n3.\tAdd Knorr Beef Cube. Cover the pressure cooker. Cook for 30 minutes.\r\n4.\tPan-fry carrot and potato until it browns. Set aside.\r\n5.\tAdd chili pepper, liver spread and peanut butter. Stir.\r\n6.\tAdd bell peppers, fried potato and carrot. Cover the pot. Continue cooking for 5 to 7 minutes.\r\n7.\tSeason with salt and ground black pepper. Serve.\r\n",
            "strMealThumb": "https://www.themealdb.com/images/media/meals/41cxjh1683207682.jpg",
            "strTags": null,
            "strYoutube": "https://www.youtube.com/watch?v=yI7hTz0ft5k",
            "price": "3"
        },
        {
            "idMeal": "52873",
            "strMeal": "Beef Dumpling Stew",
            "strDrinkAlternate": null,
            "strCategory": "Beef",
            "strArea": "British",
            "strInstructions": "Preheat the oven to 180C/350F/Gas 4.\r\n\r\nFor the beef stew, heat the oil and butter in an ovenproof casserole and fry the beef until browned on all sides.\r\n\r\nSprinkle over the flour and cook for a further 2-3 minutes.\r\n\r\nAdd the garlic and all the vegetables and fry for 1-2 minutes.\r\n\r\nStir in the wine, stock and herbs, then add the Worcestershire sauce and balsamic vinegar, to taste. Season with salt and freshly ground black pepper.\r\n\r\nCover with a lid, transfer to the oven and cook for about two hours, or until the meat is tender.\r\n\r\nFor the dumplings, sift the flour, baking powder and salt into a bowl.\r\nAdd the suet and enough water to form a thick dough.\r\n\r\nWith floured hands, roll spoonfuls of the dough into small balls.\r\n\r\nAfter two hours, remove the lid from the stew and place the balls on top of the stew. Cover, return to the oven and cook for a further 20 minutes, or until the dumplings have swollen and are tender. (If you prefer your dumplings with a golden top, leave the lid off when returning to the oven.)\r\n\r\nTo serve, place a spoonful of mashed potato onto each of four serving plates and top with the stew and dumplings. Sprinkle with chopped parsley.",
            "strMealThumb": "https://www.themealdb.com/images/media/meals/uyqrrv1511553350.jpg",
            "strTags": "Stew,Baking",
            "strYoutube": "https://www.youtube.com/watch?v=6NgheY-r5t0",
            "price": "33.2"
        },
        {
            "idMeal": "52952",
            "strMeal": "Beef Lo Mein",
            "strDrinkAlternate": null,
            "strCategory": "Beef",
            "strArea": "Chinese",
            "strInstructions": "STEP 1 - MARINATING THE BEEF\r\nIn a bowl, add the beef, salt, 1 pinch white pepper, 1 Teaspoon sesame seed oil, 1/2 egg, corn starch,1 Tablespoon of oil and mix together.\r\nSTEP 2 - BOILING THE THE NOODLES\r\nIn a 6 qt pot add your noodles to boiling water until the noodles are submerged and boil on high heat for 10 seconds. After your noodles is done boiling strain and cool with cold water.\r\nSTEP 3 - STIR FRY\r\nAdd 2 Tablespoons of oil, beef and cook on high heat untill beef is medium cooked.\r\nSet the cooked beef aside\r\nIn a wok add 2 Tablespoon of oil, onions, minced garlic, minced ginger, bean sprouts, mushrooms, peapods and 1.5 cups of water or until the vegetables are submerged in water.\r\nAdd the noodles to wok\r\nTo make the sauce, add oyster sauce, 1 pinch white pepper, 1 teaspoon sesame seed oil, sugar, and 1 Teaspoon of soy sauce.\r\nNext add the beef to wok and stir-fry",
            "strMealThumb": "https://www.themealdb.com/images/media/meals/1529444830.jpg",
            "strTags": null,
            "strYoutube": "https://www.youtube.com/watch?v=ZT9LSsNXXe0",
            "price": "2"
        },
        {
            "idMeal": "53068",
            "strMeal": "Beef Mechado",
            "strDrinkAlternate": null,
            "strCategory": "Beef",
            "strArea": "Filipino",
            "strInstructions": "0.\tMake the beef tenderloin marinade by combining soy sauce, vinegar, ginger, garlic, sesame oil, olive oil, sugar, salt, and ground black pepper in a large bowl. Mix well.\r\n1.\tAdd the cubed beef tenderloin to the bowl with the beef tenderloin marinade. Gently toss to coat the beef. Let it stay for 1 hour.\r\n2.\tUsing a metal or bamboo skewer, assemble the beef kebob by skewering the vegetables and marinated beef tenderloin.\r\n3.\tHeat-up the grill and start grilling the beef kebobs for 3 minutes per side. This will give you a medium beef that is juicy and tender on the inside. Add more time if you want your beef well done, but it will be less tender.\r\n4.\tTransfer to a serving plate. Serve with Saffron rice.\r\n5.\tShare and enjoy!\r\n",
            "strMealThumb": "https://www.themealdb.com/images/media/meals/cgl60b1683206581.jpg",
            "strTags": "Stew, Warming",
            "strYoutube": "https://www.youtube.com/watch?v=jxW3Lj8VjyE",
            "price": "9.8"
        },
        {
            "idMeal": "53053",
            "strMeal": "Beef Rendang",
            "strDrinkAlternate": null,
            "strCategory": "Beef",
            "strArea": "Malaysian",
            "strInstructions": "Chop the spice paste ingredients and then blend it in a food processor until fine.\r\nHeat the oil in a stew pot, add the spice paste, cinnamon, cloves, star anise, and cardamom and stir-fry until aromatic. Add the beef and the pounded lemongrass and stir for 1 minute. Add the coconut milk, tamarind juice, water, and simmer on medium heat, stirring frequently until the meat is almost cooked. Add the kaffir lime leaves, kerisik (toasted coconut), sugar or palm sugar, stirring to blend well with the meat.\r\nLower the heat to low, cover the lid, and simmer for 1 to 1 1/2 hours or until the meat is really tender and the gravy has dried up. Add more salt and sugar to taste. Serve immediately with steamed rice and save some for overnight.",
            "strMealThumb": "https://www.themealdb.com/images/media/meals/bc8v651619789840.jpg",
            "strTags": null,
            "strYoutube": "https://www.youtube.com/watch?v=Ot-dmfBaZrA",
            "price": "8.7"
        },
        {
            "idMeal": "52824",
            "strMeal": "Beef Sunday Roast",
            "strDrinkAlternate": null,
            "strCategory": "Beef",
            "strArea": "British",
            "strInstructions": "Cook the Broccoli and Carrots in a pan of boiling water until tender.\r\n\r\nRoast the Beef and Potatoes in the oven for 45mins, the potatoes may need to be checked regularly to not overcook.\r\n\r\nTo make the Yorkshire puddings:\r\nHeat oven to 230C/fan 210C/gas 8. Drizzle a little sunflower oil evenly into 2 x 4-hole Yorkshire pudding tins or a 12-hole non-stick muffin tin and place in the oven to heat through\r\nTo make the batter, tip 140g plain flour into a bowl and beat in four eggs until smooth. Gradually add 200ml milk and carry on beating until the mix is completely lump-free. Season with salt and pepper. Pour the batter into a jug, then remove the hot tins from the oven. Carefully and evenly pour the batter into the holes. Place the tins back in the oven and leave undisturbed for 20-25 mins until the puddings have puffed up and browned. Serve immediately.\r\n\r\nPlate up and add the Gravy as desired.",
            "strMealThumb": "https://www.themealdb.com/images/media/meals/ssrrrs1503664277.jpg",
            "strTags": "MainMeal",
            "strYoutube": "https://www.youtube.com/watch?v=2l3-dBdNehY",
            "price": "3.23"
        },
        {
            "idMeal": "53069",
            "strMeal": "Bistek",
            "strDrinkAlternate": null,
            "strCategory": "Beef",
            "strArea": "Filipino",
            "strInstructions": "0.\tMarinate beef in soy sauce, lemon (or calamansi), and ground black pepper for at least 1 hour. Note: marinate overnight for best result\r\n1.\tHeat the cooking oil in a pan then pan-fry half of the onions until the texture becomes soft. Set aside\r\n2.\tDrain the marinade from the beef. Set it aside. Pan-fry the beef on the same pan where the onions were fried for 1 minute per side. Remove from the pan. Set aside\r\n3.\tAdd more oil if needed. Saute garlic and remaining raw onions until onion softens.\r\n4.\tPour the remaining marinade and water. Bring to a boil.\r\n5.\tAdd beef. Cover the pan and simmer until the meat is tender. Note: Add water as needed.\r\n6.\tSeason with ground black pepper and salt as needed. Top with pan-fried onions.\r\n7.\tTransfer to a serving plate. Serve hot. Share and Enjoy!\r\n",
            "strMealThumb": "https://www.themealdb.com/images/media/meals/4pqimk1683207418.jpg",
            "strTags": null,
            "strYoutube": "https://www.youtube.com/watch?",
            "price": "9"
        },
        {
            "idMeal": "52979",
            "strMeal": "Bitterballen (Dutch meatballs)",
            "strDrinkAlternate": null,
            "strCategory": "Beef",
            "strArea": "Dutch",
            "strInstructions": "Melt the butter in a skillet or pan. When melted, add the flour little by little and stir into a thick paste. Slowly stir in the stock, making sure the roux absorbs the liquid. Simmer for a couple of minutes on a low heat while you stir in the onion, parsley and the shredded meat. The mixture should thicken and turn into a heavy, thick sauce.\r\n\r\nPour the mixture into a shallow container, cover and refrigerate for several hours, or until the sauce has solidified.\r\n\r\nTake a heaping tablespoon of the cold, thick sauce and quickly roll it into a small ball. Roll lightly through the flour, then the egg and finally the breadcrumbs. Make sure that the egg covers the whole surface of the bitterbal. When done, refrigerate the snacks while the oil in your fryer heats up to 190C (375F). Fry four bitterballen at a time, until golden.\r\n\r\nServe on a plate with a nice grainy or spicy mustard. \r\n",
            "strMealThumb": "https://www.themealdb.com/images/media/meals/lhqev81565090111.jpg",
            "strTags": "DinnerParty,HangoverFood,Alcoholic",
            "strYoutube": "https://www.youtube.com/watch?v=q8AKfYUtDuM",
            "price": "23.3"
        },
        {
            "idMeal": "52826",
            "strMeal": "Braised Beef Chilli",
            "strDrinkAlternate": null,
            "strCategory": "Beef",
            "strArea": "Mexican",
            "strInstructions": "Preheat the oven to 120C/225F/gas mark 1.\r\n\r\nTake the meat out of the fridge to de-chill. Pulse the onions and garlic in a food processor until finely chopped. Heat 2 tbsp olive oil in a large casserole and sear the meat on all sides until golden.\r\n\r\nSet to one side and add another small slug of oil to brown the chorizo. Remove and add the onion and garlic, spices, herbs and chillies then cook until soft in the chorizo oil. Season with salt and pepper and add the vinegar, tomatoes, ketchup and sugar.\r\n\r\nPut all the meat back into the pot with 400ml water (or red wine if you prefer), bring up to a simmer and cook, covered, in the low oven.\r\n\r\nAfter 2 hours, check the meat and add the beans. Cook for a further hour and just before serving, pull the meat apart with a pair of forks.",
            "strMealThumb": "https://www.themealdb.com/images/media/meals/uuqvwu1504629254.jpg",
            "strTags": null,
            "strYoutube": "https://www.youtube.com/watch?v=z4kSoJgsu6Y",
            "price": "12.3"
        },
        {
            "idMeal": "53031",
            "strMeal": "Egyptian Fatteh",
            "strDrinkAlternate": null,
            "strCategory": "Beef",
            "strArea": "Egyptian",
            "strInstructions": "To prepare bread for bottom of dish: Take pita bread and rip into bite size pieces. In a frying pan, add about a 1/4 stick of butter, add bread pieces and fry until golden brown and crisp. Put these pieces in a glass baking dish, preferably a square sized dish. Set aside.\r\nThen add to same pan, a little more butter, salt, approximately 2 cloves of crushed fresh garlic, and a teaspoon or so of cumin stir around a bit until you can smell aroma, then add fried bread pieces to this mixture, stir to coat bread and put back into glass baking dish. Set aside.\r\nTo prepare meat: put some butter in a pot, stir fry meat until brown, add 1 onion quartered, salt & pepper, 1 cube of chicken bouillon and water to cover meat. Bring to a boil, turn down to simmer, cover and cook until tender, approximately 2 hours. After meat has cooled, take out chunks of meat and put in a bowl, set aside. Reserve soup from the meat separately.\r\nTo prepare the rice: Put some butter into a pot, add shareya (fideo noodles) like a handful or so, keep stirring until golden brown, not too dark, but very golden. Then add two cups of rice, stir a little bit until some of the rice turns an opaque white. Add 2-1/4 cups of water and salt to taste. Bring to a boil, cover and turn down to simmer, cook until tender. Test the rice tenderness after about 35 minutes.\r\nNow take some of the soup from meat and add to the top of the bread pieces in baking dish to saturate.Add cooked rice on top of bread pieces. Slowly spoon remainder of soup onto rice, looking at glass dish sides to see level of soup, should reach just to top of rice, don’t worry, this doesn’t have to be exact. Now you’re ready to make the sauce and fry the meat to put on top.\r\nTo prepare red sauce: In a pan, add a little oil or butter, crushed tomato, a half teaspoon of tomato paste, salt & pepper, 2 cloves of fresh crushed garlic and cumin. Add also approximately 3 tablespoons of vinegar, stir this until you smell aroma and it is a bit smooth. It should be a bit thick, not watery, but if too thick you can add a bit of water. Spread with a wooden spoon atop the rice to cover.\r\nTo fry meat: In a pan add a bit of butter or oil, the meat, just a touch of tomato paste, about a tablespoon of fresh crushed garlic, salt & pepper, a teaspoon of cumin. Cook until meat is golden fried.\r\nSpoon this atop the rice and serve. Enjoy!",
            "strMealThumb": "https://www.themealdb.com/images/media/meals/rlwcc51598734603.jpg",
            "strTags": null,
            "strYoutube": "https://www.youtube.com/watch?v=WLuOHkDE4A4",
            "price": "2.3"
        },
        {
            "idMeal": "52827",
            "strMeal": "Massaman Beef curry",
            "strDrinkAlternate": null,
            "strCategory": "Beef",
            "strArea": "Thai",
            "strInstructions": "Heat oven to 200C/180C fan/gas 6, then roast the peanuts on a baking tray for 5 mins until golden brown. When cool enough to handle, roughly chop. Reduce oven to 180C/160C fan/gas 4.\r\nHeat 2 tbsp coconut cream in a large casserole dish with a lid. Add the curry paste and fry for 1 min, then stir in the beef and fry until well coated and sealed. Stir in the rest of the coconut with half a can of water, the potatoes, onion, lime leaves, cinnamon, tamarind, sugar, fish sauce and most of the peanuts. Bring to a simmer, then cover and cook for 2 hrs in the oven until the beef is tender.\r\nSprinkle with sliced chilli and the remaining peanuts, then serve straight from the dish with jasmine rice.",
            "strMealThumb": "https://www.themealdb.com/images/media/meals/tvttqv1504640475.jpg",
            "strTags": "Curry",
            "strYoutube": "https://www.youtube.com/watch?v=mVxgZSCU9_g",
            "price": "3.8"
        },
        {
            "idMeal": "53006",
            "strMeal": "Moussaka",
            "strDrinkAlternate": null,
            "strCategory": "Beef",
            "strArea": "Greek",
            "strInstructions": "Heat the grill to high. Brown the beef in a deep ovenproof frying pan over a high heat for 5 mins. Meanwhile, prick the aubergine with a fork, then microwave on High for 3-5 mins until soft. Mix the yogurt, egg and parmesan together, then add a little seasoning.\r\n\r\nStir the tomatoes, purée and potatoes in with the beef with some seasoning and heat through. Smooth the surface of the beef mixture with the back of a spoon, then slice the cooked aubergine and arrange on top. Pour the yogurt mixture over the aubergines, smooth out evenly, then grill until the topping has set and turned golden.",
            "strMealThumb": "https://www.themealdb.com/images/media/meals/ctg8jd1585563097.jpg",
            "strTags": null,
            "strYoutube": "https://www.youtube.com/watch?v=8U_29i9Qp5U",
            "price": "8.99"
        },
        {
            "idMeal": "53029",
            "strMeal": "Mulukhiyah",
            "strDrinkAlternate": null,
            "strCategory": "Beef",
            "strArea": "Egyptian",
            "strInstructions": "Saute the onions in the 3-4 tablespoons olive oil\r\nAdd the beef cubes or the chicken cutlets, sear for 3-4 min on each side\r\nAdd 1 liter of water or just enough to cover the meat\r\nCook over medium heat until the meat is done (I usually do this in the pressure cooker and press them for 5 min)\r\n\r\nAdd the frozen mulukhyia and stir until it thaws completely and then comes to a boil\r\n\r\nIn another pan add the 1/4 to 1/2 cup of olive oil and the cloves of garlic and cook over medium low heat until you can smell the garlic (don’t brown it, it will become bitter)\r\n\r\nAdd the oil and garlic to the mulukhyia and lower the heat and simmer for 5-10 minutes\r\nAdd salt to taste\r\n\r\nServe with a generous amount of lemon juice.\r\n\r\nYou can serve it with some short grain rice or some pita bread",
            "strMealThumb": "https://www.themealdb.com/images/media/meals/x372ug1598733932.jpg",
            "strTags": null,
            "strYoutube": "https://www.youtube.com/watch?v=vWc5JzgAkIQ",
            "price": "2.21"
        },
        {
            "idMeal": "52941",
            "strMeal": "Red Peas Soup",
            "strDrinkAlternate": null,
            "strCategory": "Beef",
            "strArea": "Jamaican",
            "strInstructions": "Wash and rinse the dried kidney beans.. then cover with water in a deep bowl. Remember as they soak they will expand to at least triple the size they were originally so add a lot of water to the bowl. Soak them overnight or for at least 2 hrs to make the cooking step go quicker. I tossed out the water they were soaked in after it did the job.\r\n\r\nHave your butcher cut the salted pigtail into 2 inch pieces as it will be very difficult to cut with an ordinary kitchen knife. Wash, then place a deep pot with water and bring to a boil. Cook for 20 minutes, then drain + rinse and repeat (boil again in water). The goal is to make the pieces of pig tails tender and to remove most of the salt it was cured in.\r\n\r\nTime to start the soup. Place everything in the pot (except the flour and potato), then cover with water and place on a high flame to bring to a boil. As it comes to a boil, skim off any scum/froth at the top and discard. Reduce the heat to a gentle boil and allow it to cook for 1 hr and 15 mins.. basically until the beans are tender and start falling apart.\r\n\r\nIt’s now time to add the potato (and Yams etc if you’re adding it) as well as the coconut milk and continue cooking for 15 minutes.\r\n\r\nNow is a good time to start making the basic dough for the spinner dumplings. Mix the flour and water (add a pinch of salt if you want) until you have a soft/smooth dough. allow it to rest for 5 minutes, then pinch of a tablespoon at a time and roll between your hands to form a cigarette shape.\r\n\r\nAdd them to the pot, stir well and continue cooking for another 15 minutes on a rolling boil.\r\n\r\nYou’ll notice that I didn’t add any salt to the pot as the remaining salt from the salted pigtails will be enough to properly season this dish. However you can taste and adjust accordingly. Lets recap the timing part of things so you’re not confused. Cook the base of the soup for 1 hr and 15 minute or until tender, then add the potatoes and cook for 15 minutes, then add the dumplings and cook for a further 15 minutes. Keep in mind that this soup will thicken quite a bit as it cools.\r\n\r\nWhile this is not a traditional recipe to any one specific island, versions of this soup (sometimes called stewed peas) can be found throughout the Caribbean, Latin America and Africa. A hearty bowl of this soup will surely give you the sleepies (some may call it ethnic fatigue). You can certainly freeze the leftovers and heat it up another day.",
            "strMealThumb": "https://www.themealdb.com/images/media/meals/sqpqtp1515365614.jpg",
            "strTags": "Soup,SideDish",
            "strYoutube": "https://www.youtube.com/watch?v=1ogCfDXotMw",
            "price": "23"
        },
        {
            "idMeal": "52881",
            "strMeal": "Steak and Kidney Pie",
            "strDrinkAlternate": null,
            "strCategory": "Beef",
            "strArea": "British",
            "strInstructions": "Preheat the oven to 220C/425F/Gas 7\r\nHeat the vegetable oil in a large frying pan, and brown the beef all over. (You may need to do this in batches.) Set aside, then brown the kidneys on both sides in the same pan. Add the onions and cook for 3-4 minutes.\r\nReturn the beef to the pan, sprinkle flour over and coat the meat and onions\r\nAdd the stock to the pan, stir well and bring to the boil.\r\nTurn the heat down and simmer for 1½ hours without a lid. If the liquid evaporates too much, add more stock.\r\nRemove from the heat. Add salt, pepper and Worcestershire sauce and allow to cool completely. Place the cooked meat mixture into a pie dish.\r\nRoll out the pastry to 5mm/¼in thick and 5cm/2in larger than the dish you are using.\r\nUsing a rolling pin, lift the pastry and place it over the top of the pie dish. Trim and crimp the edges with your fingers and thumb.\r\nBrush the surface with the beaten egg mixture and bake for 30-40 minutes until golden-brown and puffed.\r\nServe with creamy mash and steamed vegetables to soak up the gravy.",
            "strMealThumb": "https://www.themealdb.com/images/media/meals/qysyss1511558054.jpg",
            "strTags": "Pie",
            "strYoutube": "https://www.youtube.com/watch?v=oTw5tPt4KmA",
            "price": "89"
        },
        {
            "idMeal": "52950",
            "strMeal": "Szechuan Beef",
            "strDrinkAlternate": null,
            "strCategory": "Beef",
            "strArea": "Chinese",
            "strInstructions": "STEP 1 - MARINATING THE BEEF\r\nIn a bowl, add the beef, salt, sesame seed oil, white pepper, egg white, 2 Tablespoon of corn starch and 1 Tablespoon of oil.\r\nSTEP 2 - STIR FRY\r\nFirst Cook the beef by adding 2 Tablespoon of oil until the beef is golden brown.\r\nSet the beef aside\r\nIn a wok add 1 Tablespoon of oil, minced ginger, minced garlic and stir-fry for few seconds.\r\nNext add all of the vegetables and then add sherry cooking wine and 1 cup of water.\r\nTo make the sauce add oyster sauce, hot pepper sauce, and sugar.\r\nadd the cooked beef and 1 spoon of soy sauce\r\nTo thicken the sauce, whisk together 1 Tablespoon of cornstarch and 2 Tablespoon of water in a bowl and slowly add to your stir-fry until it's the right thickness.",
            "strMealThumb": "https://www.themealdb.com/images/media/meals/1529443236.jpg",
            "strTags": null,
            "strYoutube": "https://www.youtube.com/watch?v=SQGZqZYz7Ms",
            "price": "10"
        },
        {
            "idMeal": "53057",
            "strMeal": "Traditional Croatian Goulash",
            "strDrinkAlternate": null,
            "strCategory": "Beef",
            "strArea": "Croatian",
            "strInstructions": "Clean the meat from the veins if there are some and cut it into smaller pieces, 3 × 3 cm. Marinate the meat in the mustard and spices and let it sit in the refrigerator for one hour\r\nHeat one tablespoon of pork fat or vegetable oil in a pot and fry the meat on all sides until it gets browned. Once the meat is cooked, transfer it to a plate and add another tablespoon of fat to the pot\r\nCut the onions very fine, peel the carrots and shred it using a grater. Cook the onions and carrots over low heat for 15 minutes. You can salt the vegetables a little to make them soften faster\r\nOnce the vegetables have browned and become slightly mushy, add the meat and bay leaves and garlic. Pour over with wine and simmer for 10-15 minutes to allow the alcohol to evaporate. Now is the right time to add 2/3 the amount of liquid\r\nCover the pot and cook over low heat for an hour, stirring occasionally. After the first hour, pour over the rest of the water or stock and cook for another 30-45 minutes\r\nAllow the stew to cool slightly and serve it with a sprinkle of chopped parsley and few slices of fresh hot pepper if you like to spice it up a bit\r\nSlice ​​some fresh bread, season the salad and simply enjoying these wonderful flavors",
            "strMealThumb": "https://www.themealdb.com/images/media/meals/n1hcou1628770088.jpg",
            "strTags": "Soup",
            "strYoutube": "https://www.youtube.com/watch?v=ipEz5u2T7KM",
            "price": "8"
        },
        {
            "idMeal": "52940",
            "strMeal": "Brown Stew Chicken",
            "strDrinkAlternate": null,
            "strCategory": "Chicken",
            "strArea": "Jamaican",
            "strInstructions": "Squeeze lime over chicken and rub well. Drain off excess lime juice.\r\nCombine tomato, scallion, onion, garlic, pepper, thyme, pimento and soy sauce in a large bowl with the chicken pieces. Cover and marinate at least one hour.\r\nHeat oil in a dutch pot or large saucepan. Shake off the seasonings as you remove each piece of chicken from the marinade. Reserve the marinade for sauce.\r\nLightly brown the chicken a few pieces at a time in very hot oil. Place browned chicken pieces on a plate to rest while you brown the remaining pieces.\r\nDrain off excess oil and return the chicken to the pan. Pour the marinade over the chicken and add the carrots. Stir and cook over medium heat for 10 minutes.\r\nMix flour and coconut milk and add to stew, stirring constantly. Turn heat down to minimum and cook another 20 minutes or until tender.",
            "strMealThumb": "https://www.themealdb.com/images/media/meals/sypxpx1515365095.jpg",
            "strTags": "Stew",
            "strYoutube": "https://www.youtube.com/watch?v=_gFB1fkNhXs",
            "price": "78"
        },
        {
            "idMeal": "52846",
            "strMeal": "Chicken & mushroom Hotpot",
            "strDrinkAlternate": null,
            "strCategory": "Chicken",
            "strArea": "British",
            "strInstructions": "Heat oven to 200C/180C fan/gas 6. Put the butter in a medium-size saucepan and place over a medium heat. Add the onion and leave to cook for 5 mins, stirring occasionally. Add the mushrooms to the saucepan with the onions.\r\n\r\nOnce the onion and mushrooms are almost cooked, stir in the flour – this will make a thick paste called a roux. If you are using a stock cube, crumble the cube into the roux now and stir well. Put the roux over a low heat and stir continuously for 2 mins – this will cook the flour and stop the sauce from having a floury taste.\r\n\r\nTake the roux off the heat. Slowly add the fresh stock, if using, or pour in 500ml water if you’ve used a stock cube, stirring all the time. Once all the liquid has been added, season with pepper, a pinch of nutmeg and mustard powder. Put the saucepan back onto a medium heat and slowly bring it to the boil, stirring all the time. Once the sauce has thickened, place on a very low heat. Add the cooked chicken and vegetables to the sauce and stir well. Grease a medium-size ovenproof pie dish with a little butter and pour in the chicken and mushroom filling.\r\n\r\nCarefully lay the potatoes on top of the hot-pot filling, overlapping them slightly, almost like a pie top.\r\n\r\nBrush the potatoes with a little melted butter and cook in the oven for about 35 mins. The hot-pot is ready once the potatoes are cooked and golden brown.",
            "strMealThumb": "https://www.themealdb.com/images/media/meals/uuuspp1511297945.jpg",
            "strTags": null,
            "strYoutube": "https://www.youtube.com/watch?v=bXKWu4GojNI",
            "price": "2.9"
        },
        {
            "idMeal": "52796",
            "strMeal": "Chicken Alfredo Primavera",
            "strDrinkAlternate": null,
            "strCategory": "Chicken",
            "strArea": "Italian",
            "strInstructions": "Heat 1 tablespoon of butter and 2 tablespoons of olive oil in a large skillet over medium-high heat. Season both sides of each chicken breast with seasoned salt and a pinch of pepper. Add the chicken to the skillet and cook for 5-7 minutes on each side, or until cooked through.  While the chicken is cooking, bring a large pot of water to a boil. Season the boiling water with a few generous pinches of kosher salt. Add the pasta and give it a stir. Cook, stirring occasionally, until al dente, about 12 minutes. Reserve 1/2 cup of  pasta water before draining the pasta.  Remove the chicken from the pan and transfer it to a cutting board; allow it to rest. Turn the heat down to medium and dd the remaining 1 tablespoon of butter and olive oil to the same pan you used to cook the chicken. Add the veggies (minus the garlic) and red pepper flakes to the pan and stir to coat with the oil and butter (refrain from seasoning with salt until the veggies are finished browning). Cook, stirring often, until the veggies are tender, about 5 minutes. Add the garlic and a generous pinch of salt and pepper to the pan and cook for 1 minute.  Deglaze the pan with the white wine. Continue to cook until the wine has reduced by half, about 3 minutes. Stir in the milk, heavy cream, and reserved pasta water. Bring the mixture to a gentle boil and allow to simmer and reduce for 2-3 minutes. Turn off the heat and add the Parmesan cheese and cooked pasta. Season with salt and pepper to taste. Garnish with Parmesan cheese and chopped parsley, if desired. ",
            "strMealThumb": "https://www.themealdb.com/images/media/meals/syqypv1486981727.jpg",
            "strTags": "Pasta,Meat,Dairy",
            "strYoutube": "https://www.youtube.com/watch?v=qCIbq8HywpQ",
            "price": "9.8"
        },
        {
            "idMeal": "52934",
            "strMeal": "Chicken Basquaise",
            "strDrinkAlternate": null,
            "strCategory": "Chicken",
            "strArea": "French",
            "strInstructions": "Preheat the oven to 180°C/Gas mark 4. Have the chicken joints ready to cook. Heat the butter and 3 tbsp olive oil in a flameproof casserole or large frying pan. Brown the chicken pieces in batches on both sides, seasoning them with salt and pepper as you go. Don't crowd the pan - fry the chicken in small batches, removing the pieces to kitchen paper as they are done.\r\n\r\nAdd a little more olive oil to the casserole and fry the onions over a medium heat for 10 minutes, stirring frequently, until softened but not browned. Add the rest of the oil, then the peppers and cook for another 5 minutes.\r\n\r\nAdd the chorizo, sun-dried tomatoes and garlic and cook for 2-3 minutes. Add the rice, stirring to ensure it is well coated in the oil. Stir in the tomato paste, paprika, bay leaves and chopped thyme. Pour in the stock and wine. When the liquid starts to bubble, turn the heat down to a gentle simmer. Press the rice down into the liquid if it isn't already submerged and place the chicken on top. Add the lemon wedges and olives around the chicken.\r\n\r\nCover and cook in the oven for 50 minutes. The rice should be cooked but still have some bite, and the chicken should have juices that run clear when pierced in the thickest part with a knife. If not, cook for another 5 minutes and check again.",
            "strMealThumb": "https://www.themealdb.com/images/media/meals/wruvqv1511880994.jpg",
            "strTags": "Meat",
            "strYoutube": "https://www.youtube.com/watch?v=emfm6TwsVhg",
            "price": "12.2"
        },
        {
            "idMeal": "52956",
            "strMeal": "Chicken Congee",
            "strDrinkAlternate": null,
            "strCategory": "Chicken",
            "strArea": "Chinese",
            "strInstructions": "STEP 1 - MARINATING THE CHICKEN\r\nIn a bowl, add chicken, salt, white pepper, ginger juice and then mix it together well.\r\nSet the chicken aside.\r\nSTEP 2 - RINSE THE WHITE RICE\r\nRinse the rice in a metal bowl or pot a couple times and then drain the water.\r\nSTEP 2 - BOILING THE WHITE RICE\r\nNext add 8 cups of water and then set the stove on high heat until it is boiling. Once rice porridge starts to boil, set the stove on low heat and then stir it once every 8-10 minutes for around 20-25 minutes.\r\nAfter 25 minutes, this is optional but you can add a little bit more water to make rice porridge to make it less thick or to your preference.\r\nNext add the marinated chicken to the rice porridge and leave the stove on low heat for another 10 minutes.\r\nAfter an additional 10 minutes add the green onions, sliced ginger, 1 pinch of salt, 1 pinch of white pepper and stir for 10 seconds.\r\nServe the rice porridge in a bowl\r\nOptional: add Coriander on top of the rice porridge.",
            "strMealThumb": "https://www.themealdb.com/images/media/meals/1529446352.jpg",
            "strTags": null,
            "strYoutube": "https://www.youtube.com/watch?v=kqEfk801E94",
            "price": "9.4"
        },
        {
            "idMeal": "52795",
            "strMeal": "Chicken Handi",
            "strDrinkAlternate": null,
            "strCategory": "Chicken",
            "strArea": "Indian",
            "strInstructions": "Take a large pot or wok, big enough to cook all the chicken, and heat the oil in it. Once the oil is hot, add sliced onion and fry them until deep golden brown. Then take them out on a plate and set aside.\r\nTo the same pot, add the chopped garlic and sauté for a minute. Then add the chopped tomatoes and cook until tomatoes turn soft. This would take about 5 minutes.\r\nThen return the fried onion to the pot and stir. Add ginger paste and sauté well.\r\nNow add the cumin seeds, half of the coriander seeds and chopped green chillies. Give them a quick stir.\r\nNext goes in the spices – turmeric powder and red chilli powder. Sauté the spices well for couple of minutes.\r\nAdd the chicken pieces to the wok, season it with salt to taste and cook the chicken covered on medium-low heat until the chicken is almost cooked through. This would take about 15 minutes. Slowly sautéing the chicken will enhance the flavor, so do not expedite this step by putting it on high heat.\r\nWhen the oil separates from the spices, add the beaten yogurt keeping the heat on lowest so that the yogurt doesn’t split. Sprinkle the remaining coriander seeds and add half of the dried fenugreek leaves. Mix well.\r\nFinally add the cream and give a final mix to combine everything well.\r\nSprinkle the remaining kasuri methi and garam masala and serve the chicken handi hot with naan or rotis. Enjoy!",
            "strMealThumb": "https://www.themealdb.com/images/media/meals/wyxwsp1486979827.jpg",
            "strTags": null,
            "strYoutube": "https://www.youtube.com/watch?v=IO0issT0Rmc",
            "price": "23"
        },
        {
            "idMeal": "52813",
            "strMeal": "Kentucky Fried Chicken",
            "strDrinkAlternate": null,
            "strCategory": "Chicken",
            "strArea": "American",
            "strInstructions": "Preheat fryer to 350°F. Thoroughly mix together all the spice mix ingredients.\r\nCombine spice mix with flour, brown sugar and salt.\r\nDip chicken pieces in egg white to lightly coat them, then transfer to flour mixture. Turn a few times and make sure the flour mix is really stuck to the chicken. Repeat with all the chicken pieces.\r\nLet chicken pieces rest for 5 minutes so crust has a chance to dry a bit.\r\nFry chicken in batches. Breasts and wings should take 12-14 minutes, and legs and thighs will need a few more minutes. Chicken pieces are done when a meat thermometer inserted into the thickest part reads 165°F.\r\nLet chicken drain on a few paper towels when it comes out of the fryer. Serve hot.",
            "strMealThumb": "https://www.themealdb.com/images/media/meals/xqusqy1487348868.jpg",
            "strTags": "Meat,Spicy",
            "strYoutube": "https://www.youtube.com/watch?v=PTUxCvCz8Bc",
            "price": "9.0"
        },
        {
            "idMeal": "52945",
            "strMeal": "Kung Pao Chicken",
            "strDrinkAlternate": null,
            "strCategory": "Chicken",
            "strArea": "Chinese",
            "strInstructions": "Combine the sake or rice wine, soy sauce, sesame oil and cornflour dissolved in water. Divide mixture in half.\r\nIn a glass dish or bowl, combine half of the sake mixture with the chicken pieces and toss to coat. Cover dish and place in refrigerator for about 30 minutes.\r\nIn a medium frying pan, combine remaining sake mixture, chillies, vinegar and sugar. Mix together and add spring onion, garlic, water chestnuts and peanuts. Heat sauce slowly over medium heat until aromatic.\r\nMeanwhile, remove chicken from marinade and sauté in a large frying pan until juices run clear. When sauce is aromatic, add sautéed chicken and let simmer together until sauce thickens.",
            "strMealThumb": "https://www.themealdb.com/images/media/meals/1525872624.jpg",
            "strTags": null,
            "strYoutube": "https://www.youtube.com/watch?v=QqdcCHQlOe0",
            "price": "9.4"
        },
        {
            "idMeal": "52774",
            "strMeal": "Pad See Ew",
            "strDrinkAlternate": null,
            "strCategory": "Chicken",
            "strArea": "Thai",
            "strInstructions": "Mix Sauce in small bowl.\r\nMince garlic into wok with oil. Place over high heat, when hot, add chicken and Chinese broccoli stems, cook until chicken is light golden.\r\nPush to the side of the wok, crack egg in and scramble. Don't worry if it sticks to the bottom of the wok - it will char and which adds authentic flavour.\r\nAdd noodles, Chinese broccoli leaves and sauce. Gently mix together until the noodles are stained dark and leaves are wilted. Serve immediately!",
            "strMealThumb": "https://www.themealdb.com/images/media/meals/uuuspp1468263334.jpg",
            "strTags": "Pasta",
            "strYoutube": "https://www.youtube.com/watch?v=Ohy1DELF4is",
            "price": "23"
        },
        {
            "idMeal": "53039",
            "strMeal": "Piri-piri chicken and slaw",
            "strDrinkAlternate": null,
            "strCategory": "Chicken",
            "strArea": "Portuguese",
            "strInstructions": "STEP 1\r\n\r\nWhizz together all of the marinade ingredients in a small food processor. Rub the marinade onto the chicken and leave for 1 hour at room temperature.\r\n\r\nSTEP 2\r\n\r\nHeat the oven to 190C/fan 170C/gas 5. Put the chicken in a roasting tray and cook for 1 hour 20 minutes. Rest under loose foil for 20 minutes. While the chicken is resting, mix together the slaw ingredients and season. Serve the chicken with slaw, fries and condiments.",
            "strMealThumb": "https://www.themealdb.com/images/media/meals/hglsbl1614346998.jpg",
            "strTags": null,
            "strYoutube": "https://www.youtube.com/watch?v=_RKwKjskopk",
            "price": "23"
        },
        {
            "idMeal": "52814",
            "strMeal": "Thai Green Curry",
            "strDrinkAlternate": null,
            "strCategory": "Chicken",
            "strArea": "Thai",
            "strInstructions": "Put the potatoes in a pan of boiling water and cook for 5 minutes. Throw in the beans and cook for a further 3 minutes, by which time both should be just tender but not too soft. Drain and put to one side.\r\nIn a wok or large frying pan, heat the oil until very hot, then drop in the garlic and cook until golden, this should take only a few seconds. Don’t let it go very dark or it will spoil the taste. Spoon in the curry paste and stir it around for a few seconds to begin to cook the spices and release all the flavours. Next, pour in the coconut milk and let it come to a bubble.\r\nStir in the fish sauce and sugar, then the pieces of chicken. Turn the heat down to a simmer and cook, covered, for about 8 minutes until the chicken is cooked.\r\nTip in the potatoes and beans and let them warm through in the hot coconut milk, then add a lovely citrussy flavour by stirring in the shredded lime leaves (or lime zest). The basil leaves go in next, but only leave them briefly on the heat or they will quickly lose their brightness. Scatter with the lime garnish and serve immediately with boiled rice.",
            "strMealThumb": "https://www.themealdb.com/images/media/meals/sstssx1487349585.jpg",
            "strTags": "Curry,Mild",
            "strYoutube": "https://www.youtube.com/watch?v=LIbKVpBQKJI",
            "price": "3"
        },
        {
            "idMeal": "52974",
            "strMeal": "Keleya Zaara",
            "strDrinkAlternate": null,
            "strCategory": "Lamb",
            "strArea": "Tunisian",
            "strInstructions": "Heat the vegetable oil in a large frying pan over medium-high heat. Add the lamb and cook until browned on all sides, about 5 minutes. Season with saffron, salt and pepper to taste; stir in all but 4 tablespoons of the onion, and pour in the water. Bring to the boil, then cover, reduce heat to medium-low, and simmer until the lamb is tender, about 15 minutes.\r\nUncover the pan, stir in the butter and allow the sauce reduce 5 to 10 minutes to desired consistency. Season to taste with salt and pepper, then pour into a serving dish. Sprinkle with the remaining chopped onions and parsley. Garnish with lemon wedges to serve.\r\n",
            "strMealThumb": "https://www.themealdb.com/images/media/meals/8x09hy1560460923.jpg",
            "strTags": null,
            "strYoutube": "https://www.youtube.com/watch?v=u_OSIChzuL0",
            "price": "29"
        },
        {
            "idMeal": "52884",
            "strMeal": "Lancashire hotpot",
            "strDrinkAlternate": null,
            "strCategory": "Lamb",
            "strArea": "British",
            "strInstructions": "Heat oven to 160C/fan 140C/gas 3. Heat some dripping or butter in a large shallow casserole dish, brown the lamb in batches, lift to a plate, then repeat with the kidneys.\r\nFry the onions and carrots in the pan with a little more dripping until golden. Sprinkle over the flour, allow to cook for a couple of mins, shake over the Worcestershire sauce, pour in the stock, then bring to the boil. Stir in the meat and bay leaves, then turn off the heat. Arrange the sliced potatoes on top of the meat, then drizzle with a little more dripping. Cover, then place in the oven for about 1½ hrs until the potatoes are cooked.\r\nRemove the lid, brush the potatoes with a little more dripping, then turn the oven up to brown the potatoes, or finish under the grill for 5-8 mins until brown.",
            "strMealThumb": "https://www.themealdb.com/images/media/meals/uttrxw1511637813.jpg",
            "strTags": null,
            "strYoutube": "https://www.youtube.com/watch?v=w6TS5J8YRA4",
            "price": "2"
        },
        {
            "idMeal": "53008",
            "strMeal": "Stuffed Lamb Tomatoes",
            "strDrinkAlternate": null,
            "strCategory": "Lamb",
            "strArea": "Greek",
            "strInstructions": "Heat oven to 180C/160C fan/gas 4. Slice the tops off the tomatoes and reserve. Scoop out most of the pulp with a teaspoon, being careful not to break the skin. Finely chop the pulp, and keep any juices. Sprinkle the insides of the tomatoes with a little sugar to take away the acidity, then place them on a baking tray.\r\n\r\nHeat 2 tbsp olive oil in a large frying pan, add the onion and garlic, then gently cook for about 10 mins until soft but not coloured. Add the lamb, cinnamon and tomato purée, turn up the heat, then fry until the meat is browned. Add the tomato pulp and juice, the rice and the stock. Season generously. Bring to the boil, then simmer for 15 mins or until the rice is tender and the liquid has been absorbed. Set aside to cool a little, then stir in the herbs.\r\n\r\nStuff the tomatoes up to the brim, top tomatoes with their lids, drizzle with 2 tbsp more olive oil, sprinkle 3 tbsp water into the tray, then bake for 35 mins. Serve with salad and crusty bread, hot or cold.",
            "strMealThumb": "https://www.themealdb.com/images/media/meals/u55lbp1585564013.jpg",
            "strTags": null,
            "strYoutube": "https://www.youtube.com/watch?v=KfJp-QfrCz4",
            "price": "7.99"
        }
    ]
}
